In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    243     69   John  January      Q1
1  2023-01-02       B   West    463     87   Mary  January      Q1
2  2023-01-03       C  North    781     38    Bob  January      Q1
3  2023-01-04       D  South    246     12  Alice  January      Q1
4  2023-01-05       A   East    748     96   John  January      Q1
5  2023-01-06       B   West    792     88   Mary  January      Q1
6  2023-01-07       C  North    176     19    Bob  January      Q1
7  2023-01-08       D  South    860     30  Alice  January      Q1
8  2023-01-09       A   East    227     14   John  January      Q1
9  2023-01-10       B   West    248     57   Mary  January      Q1
10 2023-01-11       C  North    381     57    Bob  January      Q1
11 2023-01-12       D  South    615     70  Alice  January      Q1
12 2023-01-13       A   East    822     33   John  January      Q1
13 2023-01-14       B   West    905     37   Mary  January      Q1
14 2023-01-15       C  North    938     12    Bob  January      Q1
15 2023-01-16       D  South    721     82  Alice  January      Q1
16 2023-01-17       A   East    209     78   John  January      Q1
17 2023-01-18       B   West    624     38   Mary  January      Q1
18 2023-01-19       C  North    549     74    Bob  January      Q1
19 2023-01-20       D  South    389     62  Alice  January      Q1

In [10]:
pd.pivot_table(df, values='Sales', index= 'Region', columns='Product', aggfunc='median')

Product      A      B      C      D
Region
East     243.0    NaN    NaN    NaN
North      NaN    NaN  549.0    NaN
South      NaN    NaN    NaN  615.0
West       NaN  624.0    NaN    NaN

In [12]:
pivot2 = pd.pivot_table(df, values=['Sales', 'Units'], index='Region', columns='Product') ## values must be numeric
pivot2

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     449.8    NaN    NaN    NaN  58.0   NaN   NaN   NaN
North      NaN    NaN  565.0    NaN   NaN   NaN  40.0   NaN
South      NaN    NaN    NaN  566.2   NaN   NaN   NaN  51.2
West       NaN  606.4    NaN    NaN   NaN  61.4   NaN   NaN

In [14]:
pd.crosstab(df['Region'], df['Product']) ##(index, columns) ## values are counts

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0